Дневник_трейдера/src/Documents/СделкиЗаДень/СделкиЗаДень.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СделкиЗаДень</name>
  <registerRecords>AccumulationRegister.ОстаткиЦенныхБумаг</registerRecords>
  <attributes>
    <name>БрокерскийСчет</name>
    <type>
      <types>CatalogRef.БрокерскиеСчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сделки</name>
    <attributes>
      <name>ИдентификаторСделки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяСделки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦеннаяБумага</name>
      <type>
        <types>CatalogRef.ЦенныеБумаги</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСделки</name>
      <type>
        <types>EnumRef.ТипыСделок</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комиссия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дневник_трейдера/src/AccumulationRegisters/ОстаткиЦенныхБумаг/ОстаткиЦенныхБумаг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиЦенныхБумаг</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>БрокерскийСчет</name>
    <type>
      <types>CatalogRef.БрокерскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦеннаяБумага</name>
    <type>
      <types>CatalogRef.ЦенныеБумаги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПокупки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дневник_трейдера/src/Enums/ТипыСделок/ТипыСделок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСделок</name>
  <enumValues>
    <name>Покупка</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
</mdclass:Enum>

Дневник_трейдера/src/Documents/СделкиЗаДень/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ТаблицаСделки = Сделки.Выгрузить();
	ТаблицаСделки.Сортировать("ДатаВремяСделки");
	Сделки.Загрузить(ТаблицаСделки);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ЗапросОстаткиЦенныхБумаг = Новый Запрос(
	"ВЫБРАТЬ
	|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ОстаткиЦенныхБумагОстатки.Валюта КАК Валюта,
	|	ОстаткиЦенныхБумагОстатки.Цена КАК Цена,
	|	ОстаткиЦенныхБумагОстатки.ДатаПокупки КАК ДатаПокупки,
	|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиЦенныхБумагОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
	|			&НачалоДня,
	|			БрокерскийСчет = &БрокерскийСчет
	|				И ЦеннаяБумага В (&МассивЦенныхБумаг)) КАК ОстаткиЦенныхБумагОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦеннаяБумага,
	|	ДатаПокупки");
	
	ЗапросОстаткиЦенныхБумаг.УстановитьПараметр("НачалоДня", НачалоДня(Дата) + 6 * 3600); // остатки берутся на 6 утра
	ЗапросОстаткиЦенныхБумаг.УстановитьПараметр("БрокерскийСчет", БрокерскийСчет);
	ЗапросОстаткиЦенныхБумаг.УстановитьПараметр("МассивЦенныхБумаг", Сделки.ВыгрузитьКолонку("ЦеннаяБумага"));
	
	ОстаткиЦенныхБумаг = ЗапросОстаткиЦенныхБумаг.Выполнить().Выгрузить();
	
	// регистр ОстаткиЦенныхБумаг Приход
	Движения.ОстаткиЦенныхБумаг.Записывать = Истина;
	Для Каждого ТекСтрокаСделкиЗаДень Из Сделки Цикл
		
		Если ТекСтрокаСделкиЗаДень.ТипСделки = Перечисления.ТипыСделок.Покупка Тогда
			
			ТекОстаток = ТекСтрокаСделкиЗаДень.Количество;
			
			СтрокиОстатковПоЦБ = ОстаткиЦенныхБумаг.НайтиСтроки(Новый Структура("ЦеннаяБумага, Валюта", ТекСтрокаСделкиЗаДень.ЦеннаяБумага, ТекСтрокаСделкиЗаДень.Валюта));
			
			Для Каждого СтрОстаток Из СтрокиОстатковПоЦБ Цикл
				
				Если СтрОстаток.КоличествоОстаток >= 0 Тогда
					Продолжить;
				КонецЕсли;
				Если СтрОстаток.ДатаПокупки >= ТекСтрокаСделкиЗаДень.ДатаВремяСделки Тогда
					Продолжить;
				КонецЕсли;
				Если ТекОстаток <= 0 Тогда
					Прервать;
				КонецЕсли;
				КПоступлению = Мин(ТекОстаток, -СтрОстаток.КоличествоОстаток);
				СуммаКПоступлению = ?(-СтрОстаток.КоличествоОстаток = КПоступлению, -СтрОстаток.СуммаОстаток, СтрОстаток.СуммаОстаток * КПоступлению / СтрОстаток.КоличествоОстаток);

				Движение = Движения.ОстаткиЦенныхБумаг.Добавить();
				Движение.Период = ?(ЗначениеЗаполнено(ТекСтрокаСделкиЗаДень.ДатаВремяСделки), ТекСтрокаСделкиЗаДень.ДатаВремяСделки, Дата);
				Движение.БрокерскийСчет = БрокерскийСчет;
				Движение.Валюта = ТекСтрокаСделкиЗаДень.Валюта;
				Движение.ЦеннаяБумага = ТекСтрокаСделкиЗаДень.ЦеннаяБумага;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Цена = СтрОстаток.Цена;
				Движение.ДатаПокупки = СтрОстаток.ДатаПокупки;
				Движение.Количество = КПоступлению;
				Движение.Сумма = СуммаКПоступлению;
				
				ТекОстаток = ТекОстаток - КПоступлению;
				СтрОстаток.КоличествоОстаток = СтрОстаток.КоличествоОстаток + КПоступлению;
				СтрОстаток.СуммаОстаток = СтрОстаток.СуммаОстаток - СуммаКПоступлению;
				
			КонецЦикла;	
			
			Если ТекОстаток <> 0 Тогда
				
				Движение = Движения.ОстаткиЦенныхБумаг.Добавить();
				Движение.Период = ?(ЗначениеЗаполнено(ТекСтрокаСделкиЗаДень.ДатаВремяСделки), ТекСтрокаСделкиЗаДень.ДатаВремяСделки, Дата);
				Движение.БрокерскийСчет = БрокерскийСчет;
				Движение.Валюта = ТекСтрокаСделкиЗаДень.Валюта;
				Движение.ЦеннаяБумага = ТекСтрокаСделкиЗаДень.ЦеннаяБумага;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Количество = ТекОстаток;
				Движение.Цена = ТекСтрокаСделкиЗаДень.Цена;
				Движение.ДатаПокупки = ТекСтрокаСделкиЗаДень.ДатаВремяСделки;
				Движение.Сумма = ?(ТекОстаток = ТекСтрокаСделкиЗаДень.Количество, ТекСтрокаСделкиЗаДень.Сумма, ТекОстаток * ТекСтрокаСделкиЗаДень.Цена);
				
				СтрОстаткиЦенныхБумаг = ОстаткиЦенныхБумаг.Добавить();
				ЗаполнитьЗначенияСвойств(СтрОстаткиЦенныхБумаг, ТекСтрокаСделкиЗаДень);
				СтрОстаткиЦенныхБумаг.ДатаПокупки = ТекСтрокаСделкиЗаДень.ДатаВремяСделки;
				СтрОстаткиЦенныхБумаг.КоличествоОстаток = ТекСтрокаСделкиЗаДень.Количество;
				СтрОстаткиЦенныхБумаг.СуммаОстаток = ТекСтрокаСделкиЗаДень.Сумма;
			
			КонецЕсли;
			
		ИначеЕсли ТекСтрокаСделкиЗаДень.ТипСделки = Перечисления.ТипыСделок.Продажа Тогда
			
			ТекОстаток = ТекСтрокаСделкиЗаДень.Количество;
			
			СтрокиОстатковПоЦБ = ОстаткиЦенныхБумаг.НайтиСтроки(Новый Структура("ЦеннаяБумага, Валюта", ТекСтрокаСделкиЗаДень.ЦеннаяБумага, ТекСтрокаСделкиЗаДень.Валюта));
			
			Для Каждого СтрОстаток Из СтрокиОстатковПоЦБ Цикл
				
				Если СтрОстаток.КоличествоОстаток <= 0 Тогда
					Продолжить;
				КонецЕсли;
				Если СтрОстаток.ДатаПокупки >= ТекСтрокаСделкиЗаДень.ДатаВремяСделки Тогда
					Продолжить;
				КонецЕсли;
				Если ТекОстаток <= 0 Тогда
					Прервать;
				КонецЕсли;
				КСписанию = Мин(ТекОстаток, СтрОстаток.КоличествоОстаток);
				СуммаКСписанию = ?(СтрОстаток.КоличествоОстаток = КСписанию, СтрОстаток.СуммаОстаток, СтрОстаток.СуммаОстаток * КСписанию / СтрОстаток.КоличествоОстаток);

				Движение = Движения.ОстаткиЦенныхБумаг.Добавить();
				Движение.Период = ?(ЗначениеЗаполнено(ТекСтрокаСделкиЗаДень.ДатаВремяСделки), ТекСтрокаСделкиЗаДень.ДатаВремяСделки, Дата);
				Движение.БрокерскийСчет = БрокерскийСчет;
				Движение.Валюта = ТекСтрокаСделкиЗаДень.Валюта;
				Движение.ЦеннаяБумага = ТекСтрокаСделкиЗаДень.ЦеннаяБумага;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Цена = СтрОстаток.Цена;
				Движение.ДатаПокупки = СтрОстаток.ДатаПокупки;
				Движение.Количество = КСписанию;
				Движение.Сумма = СуммаКСписанию;
				
				ТекОстаток = ТекОстаток - КСписанию;
				СтрОстаток.КоличествоОстаток = СтрОстаток.КоличествоОстаток - КСписанию;
				СтрОстаток.СуммаОстаток = СтрОстаток.СуммаОстаток - СуммаКСписанию;
				
			КонецЦикла;	
			
			Если ТекОстаток <> 0 Тогда
				
				Движение = Движения.ОстаткиЦенныхБумаг.Добавить();
				Движение.Период = ?(ЗначениеЗаполнено(ТекСтрокаСделкиЗаДень.ДатаВремяСделки), ТекСтрокаСделкиЗаДень.ДатаВремяСделки, Дата);
				Движение.БрокерскийСчет = БрокерскийСчет;
				Движение.Валюта = ТекСтрокаСделкиЗаДень.Валюта;
				Движение.ЦеннаяБумага = ТекСтрокаСделкиЗаДень.ЦеннаяБумага;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Количество = ТекОстаток;
				Движение.Цена = ТекСтрокаСделкиЗаДень.Цена;
				Движение.ДатаПокупки = ТекСтрокаСделкиЗаДень.ДатаВремяСделки;
				Движение.Сумма = ТекОстаток * ТекСтрокаСделкиЗаДень.Цена;
				
				СтрОстаткиЦенныхБумаг = ОстаткиЦенныхБумаг.Добавить();
				ЗаполнитьЗначенияСвойств(СтрОстаткиЦенныхБумаг, ТекСтрокаСделкиЗаДень);
				СтрОстаткиЦенныхБумаг.ДатаПокупки = ТекСтрокаСделкиЗаДень.ДатаВремяСделки;
				СтрОстаткиЦенныхБумаг.КоличествоОстаток = -ТекСтрокаСделкиЗаДень.Количество;
				СтрОстаткиЦенныхБумаг.СуммаОстаток = -ТекСтрокаСделкиЗаДень.Сумма;
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
